Tutorials/pimpleHFDIBFoam/suspension_viscosity/constant/distributionDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      distributionict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 	0.000001;

distribution 15
(
0.000
6.483
9.324
12.092
13.853
13.861
12.564
10.131
6.991
4.109
2.112
0.994
0.454
0.215
0.000
);

particleSize 15
(
4.472
5.122
5.867
6.72
7.697
8.816
10.097
11.565
13.246
15.172
17.377
19.904
22.797
26.111
29.907
);
// ************************************************************************* //
