Tutorials/pimpleHFDIBFoam/suspension_viscosity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  2.3.0                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	0.001;
L 1;
W 1;
Y 2;

vertices 
(// to be specified
    // MidSquare
	//ground nodes
	 ( 0  0  0) //0
	 ( $L 0  0) //1
	 ( $L      $Y 0) //2
	 ( 0  $Y 0) //3
	//top level nodes
	 ( 0  0  $W) //4
	 ( $L      0  $W) //5
	 ( $L      $Y $W) //6
	 ( 0  $Y $W) //7
); 

blocks 
(// to be specified
	 hex ( 0 1 2 3 4 5 6 7) ( 100 200 100 ) simpleGrading (1 1 1)
//      hex ( 8 0 3 9 11 4 7 10) ( 200 200 100 ) simpleGrading (1 1 1)
); 

edges
(

    
);

boundary 
( 

	top
	{ 
	type wall; 
	faces 
 	(
	 	 ( 4 5 6 7 )
	);
	}
	
    left 
	{ 
    type cyclic;
    neighbourPatch right;
	faces 
 	(
	 	 ( 0 4 7 3 )
	);
	}
	
	right 
	{  
    type cyclic;
    neighbourPatch left;
	faces 
 	(
	 	 ( 1 2 5 6 )
	);
	}
	
	back 
	{ 
	type symmetryPlane;
	faces 
 	(
	 	 ( 2 3 7 6 )
//          ( 3 9 10 7 )
	);
	}
	
	front 
	{ 
	type symmetryPlane;
	faces 
 	(
	 	 ( 1 5 4 0 )
//          ( 0 4 11 8 )
	);
	}
	
	bottom 
	{ 
	type wall; 
	faces 
 	(
	 	 ( 2 1 0 3 )
//          ( 3 0 8 9 )
	);
	}
); 

mergePatchPairs 
( 
); 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

